src/cf/Documents/ЗапускТестирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>ЗапускТестирования</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Pipeline_ID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ветка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Ветки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВеткаСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапуститьТестыВыполненныеСОшибкой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоТестов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиЗапускаТестирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СборкаВерсии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СборкиВерсии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тег</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/InformationRegisters/РезультатыВыполненияТестов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>РезультатыВыполненияТестов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыВыполненияТеста</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЗапускТестирования</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗапускТестирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоВыполнения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЗаданияТестирования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОкончаниеВыполнения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Ветка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Ветки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тест</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Тесты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЭлементТеста</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФормыОбъектовМетаданных</v8:Type>
						<v8:Type>cfg:CatalogRef.ОбъектыМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/СтатусыВыполненияТеста.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>СтатусыВыполненияТеста</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВыполненУспешно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыполненСОшибкой</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеЗапускался</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/НастройкиЗапускаСценариев.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>НастройкиЗапускаСценариев</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ЭталонныеБазыТестирования</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СценарииРаботыПользователей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрофильПользователя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрофилиПользователей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрыЗапуска</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Публикуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыТеста</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФО</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НесколькоЗначений</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипПараметра</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипПараметраСценарияИлиПроцесса</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИсходящийПараметр</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДоТеста</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Шаг</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Данные</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяМакета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипШага</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипШагаСценария</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресДанных</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПроверкаТеста</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Шаг</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Данные</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяМакета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипШага</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипШагаСценария</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресДанных</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПослеТеста</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Шаг</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Данные</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяМакета</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипШага</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипШагаСценария</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресДанных</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Documents/ЗапускТестирования/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Автор = Пользователи.ТекущийПользователь();
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Pipeline_ID = "";
	Автор = Пользователи.ТекущийПользователь();
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение
		И Проект.ЗапускатьАвтоматическоеТестирование Тогда
		Если НЕ ЗначениеЗаполнено(Номер) Тогда
			УстановитьНовыйНомер();
		КонецЕсли;
		Результат = ТестированиеЗапускТестирования.ЗапуститьТестирование(Проект, Ветка.Имя, ПараметрыДляЗапускаТестирования());
		
		Если Результат.ЗапросВыполненУспешно Тогда
			Pipeline_ID = Результат.Ответ;
		Иначе
			Отказ = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Результат.Ответ, ЭтотОбъект);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	Если Проект.ЗапускатьАвтоматическоеТестирование
		И ЗначениеЗаполнено(Pipeline_ID) Тогда
		Результат = ТестированиеЗапускТестирования.ОтменитьТестирование(Проект, Pipeline_ID);
		Если НЕ Результат.ЗапросВыполненУспешно Тогда
			Отказ = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Результат.Ответ, ЭтотОбъект);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПараметрыДляЗапускаТестирования()
	
	Параметры = Новый Соответствие;
	Параметры.Вставить("TRIGGER_ID", СокрЛП(Номер));
	
	Запрос = Новый Запрос;
	
	Если ЗапуститьТестыВыполненныеСОшибкой Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	РезультатыВыполненияТестовСрезПоследних.Тест КАК Ссылка,
		               |	РезультатыВыполненияТестовСрезПоследних.Тест.Код КАК Код,
		               |	РезультатыВыполненияТестовСрезПоследних.Тест.Наименование КАК Наименование,
		               |	РезультатыВыполненияТестовСрезПоследних.Тест.ИмяВСистемеСборки КАК ИмяВСистемеСборки,
		               |	РезультатыВыполненияТестовСрезПоследних.Тест.UIDНастройкиСценария КАК UIDНастройкиСценария,
		               |	РезультатыВыполненияТестовСрезПоследних.Тест.НастройкаЗапускаСценария.Код КАК НастройкаЗапускаСценарияКод,
		               |	РезультатыВыполненияТестовСрезПоследних.Тест.НастройкаЗапускаПроцесса.Код КАК НастройкаЗапускаПроцессаКод,
		               |	ВЫБОР
		               |		КОГДА РезультатыВыполненияТестовСрезПоследних.Тест.НастройкаЗапускаСценария <> ЗНАЧЕНИЕ(Справочник.НастройкиЗапускаСценариев.ПустаяСсылка)
		               |			ТОГДА РезультатыВыполненияТестовСрезПоследних.Тест.НастройкаЗапускаСценария.Владелец.ИдентификаторБазы
		               |		ИНАЧЕ РезультатыВыполненияТестовСрезПоследних.Тест.НастройкаЗапускаПроцесса.ЭталоннаяБаза.ИдентификаторБазы
		               |	КОНЕЦ КАК ИдентификаторБазы
		               |ИЗ
		               |	РегистрСведений.РезультатыВыполненияТестов.СрезПоследних КАК РезультатыВыполненияТестовСрезПоследних
		               |ГДЕ
		               |	РезультатыВыполненияТестовСрезПоследних.Ветка = &Ветка
		               |	И РезультатыВыполненияТестовСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыВыполненияТеста.ВыполненСОшибкой)";
		Запрос.УстановитьПараметр("Ветка", Ветка);
		ЗаполнитьПараметрыДляЗапускаПоТестам(Запрос.Выполнить().Выбрать(), Параметры);

	КонецЕсли;
	Если ЗначениеЗаполнено(Настройка) Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	Тесты.Ссылка КАК Ссылка,
		               |	Тесты.Ссылка.Код КАК Код,
		               |	Тесты.Наименование КАК Наименование,
		               |	Тесты.ИмяВСистемеСборки КАК ИмяВСистемеСборки,
		               |	Тесты.UIDНастройкиСценария КАК UIDНастройкиСценария,
		               |	Тесты.НастройкаЗапускаСценария.Код КАК НастройкаЗапускаСценарияКод,
		               |	Тесты.НастройкаЗапускаПроцесса.Код КАК НастройкаЗапускаПроцессаКод,
		               |	ВЫБОР
		               |		КОГДА Тесты.НастройкаЗапускаСценария <> ЗНАЧЕНИЕ(Справочник.НастройкиЗапускаСценариев.ПустаяСсылка)
		               |			ТОГДА Тесты.НастройкаЗапускаСценария.Владелец.ИдентификаторБазы
		               |		ИНАЧЕ Тесты.НастройкаЗапускаПроцесса.ЭталоннаяБаза.ИдентификаторБазы
		               |	КОНЕЦ КАК ИдентификаторБазы
		               |ИЗ
		               |	Справочник.Тесты КАК Тесты
		               |ГДЕ
		               |	(Тесты.Родитель В (&Тесты)
		               |			ИЛИ Тесты.Ссылка В (&Тесты))";
		Запрос.УстановитьПараметр("Тесты", Настройка.Тесты.ВыгрузитьКолонку("Тест"));
		ЗаполнитьПараметрыДляЗапускаПоТестам(Запрос.Выполнить().Выбрать(), Параметры);
		
		Для Каждого Строка Из Настройка.ПараметрыЗапуска Цикл
			НовоеЗначение = Строка.Значение;
			Если Параметры.Получить(Строка.Ключ) <> Неопределено Тогда
				НовоеЗначение = Параметры[Строка.Ключ] + " " + НовоеЗначение;
			КонецЕсли;
			Параметры.Вставить(Строка.Ключ, НовоеЗначение);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Параметры;
	
КонецФункции

Процедура ЗаполнитьПараметрыДляЗапускаПоТестам(ВыборкаТестов, Параметры)
	ЗаписьJSON = Новый ЗаписьJSON;
	ЕстьТесты = Ложь;
	
	Пока ВыборкаТестов.Следующий() Цикл
		ЕстьТесты = Истина;
			
		ЗаписьJSON.УстановитьСтроку();
		ЗаписьJSON.ЗаписатьНачалоОбъекта();
		ЗаписьJSON.ЗаписатьИмяСвойства("Тест");
		ЗаписьJSON.ЗаписатьЗначение(XMLСтрока(ВыборкаТестов.Наименование));
		ЗаписьJSON.ЗаписатьИмяСвойства("ИмяВСистемеСборки");
		ЗаписьJSON.ЗаписатьЗначение(XMLСтрока(ВыборкаТестов.ИмяВСистемеСборки));
		ЗаписьJSON.ЗаписатьИмяСвойства("UIDНастройкиСценария");
		ЗаписьJSON.ЗаписатьЗначение(XMLСтрока(ВыборкаТестов.UIDНастройкиСценария));
		ЗаписьJSON.ЗаписатьИмяСвойства("НастройкаЗапускаСценария");
		ЗаписьJSON.ЗаписатьЗначение(XMLСтрока(ВыборкаТестов.НастройкаЗапускаСценарияКод));
		ЗаписьJSON.ЗаписатьИмяСвойства("НастройкаЗапускаПроцесса");
		ЗаписьJSON.ЗаписатьЗначение(XMLСтрока(ВыборкаТестов.НастройкаЗапускаПроцессаКод));
		ЗаписьJSON.ЗаписатьИмяСвойства("ИдентификаторБазы");
		ЗаписьJSON.ЗаписатьЗначение(XMLСтрока(ВыборкаТестов.ИдентификаторБазы));
		ЗаписьJSON.ЗаписатьКонецОбъекта();
		
		JsonТесты = ЗаписьJSON.Закрыть();
		Параметры.Вставить("test" + СокрЛП(ВыборкаТестов.Код), JsonТесты);
			
	КонецЦикла;
	Если ЕстьТесты Тогда 
		Параметры.Вставить("TEST_FILTER", "TRUE");
	КонецЕсли;
	
	ЗаписьJSON = Неопределено;
КонецПроцедуры

#КонецОбласти

#КонецЕсли
